<a target="_blank" href="https://colab.research.google.com/github/michalis0/Cloud-and-Advanced-Analytics/blob/main/labs/week_02/solutions/week_02_exercises_big_query_sol.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

# Google BigQuery

## Walkthrough

### Authentication

In [1]:
import os

PROJECT_NAME = "cloud-analytics-init" # REPLACE WITH YOUR PROJECT NAME
PATH_TO_KEY = os.path.join(os.path.dirname(os.path.dirname(os.getcwd())), "google_key.json") # REPLACE WITH YOUR PATH TO KEY
PATH_TO_KEY

'/Users/etiennebruno/Library/CloudStorage/OneDrive-epfl.ch/ETIENNE/EPFL/EPFL_Master/MA4_EPFL/TAs/CAA/google_key.json'

#### For Colab users (recommended)

In [2]:
# from google.colab import auth
# auth.authenticate_user()
# print("Authenticated")

#### For Jupyter users ONLY (more challenging)

Follow [this](https://cloud.google.com/iam/docs/creating-managing-service-account-keys) guide to create the JSON with the service account key. Then, make sure to replace "PATH_TO_CREDENTIALS_FILE" with the *absolute* path to the JSON service account key (e.g., "C:/Users/John/credentials.json").

In [3]:
%pip install google-cloud-bigquery
%pip install db-dtypes

Requirement already satisfied: google-cloud-bigquery in /Users/etiennebruno/opt/anaconda3/lib/python3.9/site-packages (3.6.0)
Requirement already satisfied: google-resumable-media<3.0dev,>=0.6.0 in /Users/etiennebruno/opt/anaconda3/lib/python3.9/site-packages (from google-cloud-bigquery) (2.4.1)
Requirement already satisfied: requests<3.0.0dev,>=2.21.0 in /Users/etiennebruno/opt/anaconda3/lib/python3.9/site-packages (from google-cloud-bigquery) (2.28.1)
Requirement already satisfied: google-api-core[grpc]!=2.0.*,!=2.1.*,!=2.2.*,!=2.3.0,<3.0.0dev,>=1.31.5 in /Users/etiennebruno/opt/anaconda3/lib/python3.9/site-packages (from google-cloud-bigquery) (2.11.0)
Requirement already satisfied: python-dateutil<3.0dev,>=2.7.2 in /Users/etiennebruno/opt/anaconda3/lib/python3.9/site-packages (from google-cloud-bigquery) (2.8.2)
Requirement already satisfied: protobuf!=3.20.0,!=3.20.1,!=4.21.0,!=4.21.1,!=4.21.2,!=4.21.3,!=4.21.4,!=4.21.5,<5.0.0dev,>=3.19.5 in /Users/etiennebruno/opt/anaconda3/lib/python3.9/site-packages (from google-cloud-bigquery) (4.22.0)
Requirement already satisfied: grpcio<2.0dev,>=1.47.0 in /Users/etiennebruno/opt/anaconda3/lib/python3.9/site-packages (from google-cloud-bigquery) (1.51.3)
Requirement already satisfied: proto-plus<2.0.0dev,>=1.15.0 in /Users/etiennebruno/opt/anaconda3/lib/python3.9/site-packages (from google-cloud-bigquery) (1.22.2)
Requirement already satisfied: packaging>=20.0.0 in /Users/etiennebruno/opt/anaconda3/lib/python3.9/site-packages (from google-cloud-bigquery) (21.3)
Requirement already satisfied: google-cloud-core<3.0.0dev,>=1.6.0 in /Users/etiennebruno/opt/anaconda3/lib/python3.9/site-packages (from google-cloud-bigquery) (2.3.2)
Requirement already satisfied: googleapis-common-protos<2.0dev,>=1.56.2 in /Users/etiennebruno/opt/anaconda3/lib/python3.9/site-packages (from google-api-core[grpc]!=2.0.*,!=2.1.*,!=2.2.*,!=2.3.0,<3.0.0dev,>=1.31.5->google-cloud-bigquery) (1.58.0)
Requirement already satisfied: google-auth<3.0dev,>=2.14.1 in /Users/etiennebruno/opt/anaconda3/lib/python3.9/site-packages (from google-api-core[grpc]!=2.0.*,!=2.1.*,!=2.2.*,!=2.3.0,<3.0.0dev,>=1.31.5->google-cloud-bigquery) (2.16.1)
Requirement already satisfied: grpcio-status<2.0dev,>=1.33.2 in /Users/etiennebruno/opt/anaconda3/lib/python3.9/site-packages (from google-api-core[grpc]!=2.0.*,!=2.1.*,!=2.2.*,!=2.3.0,<3.0.0dev,>=1.31.5->google-cloud-bigquery) (1.51.3)
Requirement already satisfied: google-crc32c<2.0dev,>=1.0 in /Users/etiennebruno/opt/anaconda3/lib/python3.9/site-packages (from google-resumable-media<3.0dev,>=0.6.0->google-cloud-bigquery) (1.5.0)
Requirement already satisfied: pyparsing!=3.0.5,>=2.0.2 in /Users/etiennebruno/opt/anaconda3/lib/python3.9/site-packages (from packaging>=20.0.0->google-cloud-bigquery) (3.0.9)
Requirement already satisfied: six>=1.5 in /Users/etiennebruno/opt/anaconda3/lib/python3.9/site-packages (from python-dateutil<3.0dev,>=2.7.2->google-cloud-bigquery) (1.16.0)
Requirement already satisfied: urllib3<1.27,>=1.21.1 in /Users/etiennebruno/opt/anaconda3/lib/python3.9/site-packages (from requests<3.0.0dev,>=2.21.0->google-cloud-bigquery) (1.26.12)
Requirement already satisfied: idna<4,>=2.5 in /Users/etiennebruno/opt/anaconda3/lib/python3.9/site-packages (from requests<3.0.0dev,>=2.21.0->google-cloud-bigquery) (3.4)
Requirement already satisfied: charset-normalizer<3,>=2 in /Users/etiennebruno/opt/anaconda3/lib/python3.9/site-packages (from requests<3.0.0dev,>=2.21.0->google-cloud-bigquery) (2.0.4)
Requirement already satisfied: certifi>=2017.4.17 in /Users/etiennebruno/opt/anaconda3/lib/python3.9/site-packages (from requests<3.0.0dev,>=2.21.0->google-cloud-bigquery) (2022.12.7)
Requirement already satisfied: cachetools<6.0,>=2.0.0 in /Users/etiennebruno/opt/anaconda3/lib/python3.9/site-packages (from google-auth<3.0dev,>=2.14.1->google-api-core[grpc]!=2.0.*,!=2.1.*,!=2.2.*,!=2.3.0,<3.0.0dev,>=1.31.5->google-cloud-bigquery) (5.3.0)
Requirement already satisfied: pyasn1-modules>=0.2.1 in /Users/etiennebruno/opt/anaconda3/lib/python3.9/site-packages (from google-auth<3.0dev,>=2.14.1->google-api-core[grpc]!=2.0.*,!=2.1.*,!=2.2.*,!=2.3.0,<3.0.0dev,>=1.31.5->google-cloud-bigquery) (0.2.8)
Requirement already satisfied: rsa<5,>=3.1.4 in /Users/etiennebruno/opt/anaconda3/lib/python3.9/site-packages (from google-auth<3.0dev,>=2.14.1->google-api-core[grpc]!=2.0.*,!=2.1.*,!=2.2.*,!=2.3.0,<3.0.0dev,>=1.31.5->google-cloud-bigquery) (4.9)
Requirement already satisfied: pyasn1<0.5.0,>=0.4.6 in /Users/etiennebruno/opt/anaconda3/lib/python3.9/site-packages (from pyasn1-modules>=0.2.1->google-auth<3.0dev,>=2.14.1->google-api-core[grpc]!=2.0.*,!=2.1.*,!=2.2.*,!=2.3.0,<3.0.0dev,>=1.31.5->google-cloud-bigquery) (0.4.8)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: db-dtypes in /Users/etiennebruno/opt/anaconda3/lib/python3.9/site-packages (1.0.5)
Requirement already satisfied: numpy<2.0dev,>=1.16.6 in /Users/etiennebruno/opt/anaconda3/lib/python3.9/site-packages (from db-dtypes) (1.21.5)
Requirement already satisfied: pyarrow>=3.0.0 in /Users/etiennebruno/opt/anaconda3/lib/python3.9/site-packages (from db-dtypes) (10.0.1)
Requirement already satisfied: packaging>=17.0 in /Users/etiennebruno/opt/anaconda3/lib/python3.9/site-packages (from db-dtypes) (21.3)
Requirement already satisfied: pandas<2.0dev,>=0.24.2 in /Users/etiennebruno/opt/anaconda3/lib/python3.9/site-packages (from db-dtypes) (1.4.4)
Requirement already satisfied: pyparsing!=3.0.5,>=2.0.2 in /Users/etiennebruno/opt/anaconda3/lib/python3.9/site-packages (from packaging>=17.0->db-dtypes) (3.0.9)
Requirement already satisfied: python-dateutil>=2.8.1 in /Users/etiennebruno/opt/anaconda3/lib/python3.9/site-packages (from pandas<2.0dev,>=0.24.2->db-dtypes) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /Users/etiennebruno/opt/anaconda3/lib/python3.9/site-packages (from pandas<2.0dev,>=0.24.2->db-dtypes) (2022.1)
Requirement already satisfied: six>=1.5 in /Users/etiennebruno/opt/anaconda3/lib/python3.9/site-packages (from python-dateutil>=2.8.1->pandas<2.0dev,>=0.24.2->db-dtypes) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [4]:
os.environ["GOOGLE_APPLICATION_CREDENTIALS"] = PATH_TO_KEY

### Connect to BigQuery

In [5]:
import pandas as pd
from google.cloud import bigquery

# Create a "Client" object
client = bigquery.Client(project=PROJECT_NAME)

To run the cells below, you must first create a new dataset in BigQuery and upload the data from week 2 (`Teams.csv` and `Players.csv`) as tables. Since the CSV files are well-formed, you can automatically infer the schema when loading the data.

In [6]:
# Create a reference to the World Cup dataset
dataset_ref = client.dataset("world_cup", project=PROJECT_NAME)  # CHANGE WITH YOUR OWN DATASET (NOT TABLE) NAME AND PROJECT ID

# API request - fetch the dataset
dataset = client.get_dataset(dataset_ref)

In [7]:
# List the tables in the dataset
tables = list(client.list_tables(dataset))
for table in tables:  
    print(table.table_id)

players
players_and_teams
teams

In [8]:
# Create a reference to the "Teams" table and fetch the table
table_ref = dataset_ref.table("teams") # Make sure it matches the table name printed above (case sensitive)
teams_table = client.get_table(table_ref)

# Same for the "Players" table
table_ref = dataset_ref.table("players") # Make sure it matches the table name printed above (case sensitive)
players_table = client.get_table(table_ref)

In [9]:
# Display the schema of the "Teams" table 
players_table.schema

[SchemaField('surname', 'STRING', 'NULLABLE', None, None, (), None),
 SchemaField('team', 'STRING', 'NULLABLE', None, None, (), None),
 SchemaField('position', 'STRING', 'NULLABLE', None, None, (), None),
 SchemaField('minutes', 'INTEGER', 'NULLABLE', None, None, (), None),
 SchemaField('shots', 'INTEGER', 'NULLABLE', None, None, (), None),
 SchemaField('passes', 'INTEGER', 'NULLABLE', None, None, (), None),
 SchemaField('tackles', 'INTEGER', 'NULLABLE', None, None, (), None),
 SchemaField('saves', 'INTEGER', 'NULLABLE', None, None, (), None)]

In [10]:
# Show a preview of the "Teams" table using pandas
client.list_rows(teams_table, max_results=5).to_dataframe()

,team,ranking,games,wins,draws,losses,goalsFor,goalsAgainst,yellowCards,redCards
0,Honduras,38,3,0,1,2,0,3,7,0
1,North Korea,105,3,0,0,3,1,12,2,0
2,Greece,13,3,1,0,2,2,5,5,0
3,Cameroon,19,3,0,0,3,2,5,5,0
4,New Zealand,78,3,0,3,0,2,2,6,0

### Example of queries

In [11]:
q1 = """
select *
from %s.world_cup.teams
where ranking < 20
order by ranking
""" %PROJECT_NAME

query_job = client.query(q1)
query_job.to_dataframe()

,team,ranking,games,wins,draws,losses,goalsFor,goalsAgainst,yellowCards,redCards
0,Brazil,1,5,3,1,1,9,4,7,2
1,Spain,2,6,5,0,1,7,2,3,0
2,Portugal,3,4,1,2,1,7,1,8,1
3,Netherlands,4,6,6,0,0,12,5,15,0
4,Italy,5,3,0,2,1,4,5,5,0
5,Germany,6,6,4,0,2,13,3,8,1
6,Argentina,7,5,4,0,1,10,6,7,0
7,England,8,4,1,2,1,3,5,6,0
8,France,9,3,0,1,2,1,4,6,1
9,Greece,13,3,1,0,2,2,5,5,0
10,USA,14,4,1,2,1,5,5,9,0
11,Serbia,15,3,1,0,2,2,3,8,1
12,Uruguay,16,6,3,2,1,9,5,8,2
13,Mexico,17,4,1,1,2,4,5,9,0
14,Chile,18,4,2,0,2,3,5,13,1
15,Cameroon,19,3,0,0,3,2,5,5,0

In [12]:
# Join the two tables
q2 = """
select teams.*, players.surname, players.position, players.shots,
players.minutes, players.passes, players.tackles, players.saves
from %s.world_cup.teams teams
join %s.world_cup.players players
on teams.team = players.team
""" %(PROJECT_NAME, PROJECT_NAME)

query_job = client.query(q2)
query_job.to_dataframe().head(10)

,team,ranking,games,wins,draws,losses,goalsFor,goalsAgainst,yellowCards,redCards,surname,position,shots,minutes,passes,tackles,saves
0,Honduras,38,3,0,1,2,0,3,7,0,Jerry Palacios,forward,0,84,19,0,0
1,Honduras,38,3,0,1,2,0,3,7,0,Walter Martinez,forward,0,125,43,1,0
2,Honduras,38,3,0,1,2,0,3,7,0,Chavez,defender,0,270,62,3,0
3,Honduras,38,3,0,1,2,0,3,7,0,Izaguirre,defender,0,180,51,8,0
4,Honduras,38,3,0,1,2,0,3,7,0,Mauricio Sabilluen,defender,0,90,38,5,0
5,Honduras,38,3,0,1,2,0,3,7,0,Mendoza,defender,0,180,51,3,0
6,Honduras,38,3,0,1,2,0,3,7,0,Valladares,goalkeeper,0,270,51,0,12
7,Honduras,38,3,0,1,2,0,3,7,0,Espinoza,midfielder,0,135,36,4,0
8,Honduras,38,3,0,1,2,0,3,7,0,Guevara,midfielder,0,156,60,6,0
9,Honduras,38,3,0,1,2,0,3,7,0,Thomas,midfielder,0,114,37,5,0

### Basic Queries

In [13]:
query = "SELECT * FROM {}.world_cup.players LIMIT 5".format(PROJECT_NAME)
query_job = client.query(query)
query_job.to_dataframe().head(10)

     surname       team position  minutes  shots  passes  tackles  saves
0     Milito  Argentina  forward       91      0      33        0      0
1    Grafite     Brazil  forward        5      0       4        0      0
2  Kiessling    Germany  forward        7      0       5        0      0
3    Adiyiah      Ghana  forward       33      0       9        0      0
4      Amoah      Ghana  forward       11      0       4        1      0

In [14]:
query = "SELECT * FROM {}.world_cup.teams LIMIT 5".format(PROJECT_NAME)
query_job = client.query(query)
query_job.to_dataframe().head(10)

,team,ranking,games,wins,draws,losses,goalsFor,goalsAgainst,yellowCards,redCards
0,Honduras,38,3,0,1,2,0,3,7,0
1,North Korea,105,3,0,0,3,1,12,2,0
2,Greece,13,3,1,0,2,2,5,5,0
3,Cameroon,19,3,0,0,3,2,5,5,0
4,New Zealand,78,3,0,3,0,2,2,6,0

In [15]:
query = """SELECT surname, team, minutes, passes 
            FROM {}.world_cup.players 
            WHERE team="Switzerland" AND surname LIKE "%er%" 
            ORDER BY surname""".format(PROJECT_NAME)
query_job = client.query(query)
query_job.to_dataframe().head(10)

        surname         team  minutes  passes
0      Derdiyok  Switzerland      191      47
1     Fernandes  Switzerland      212      56
2         Inler  Switzerland      270     138
3  Lichtsteiner  Switzerland      270      80
4      Senderos  Switzerland       36       9
5       Ziegler  Switzerland      270      71
6    von Bergen  Switzerland      234      79

In [16]:
query = """SELECT team, COUNT(*) AS number_players_listed
            FROM {}.world_cup.players 
            GROUP BY team
            HAVING number_players_listed<20
            ORDER BY number_players_listed DESC
            LIMIT 5""".format(PROJECT_NAME)
query_job = client.query(query)
query_job.to_dataframe().head(10)

       team  number_players_listed
0    Greece                     19
1    Brazil                     19
2   Germany                     19
3  Honduras                     19
4     Ghana                     19

In [17]:
query = """SELECT surname, position, minutes, T.team, ranking, games, wins, draws, losses
            FROM {}.world_cup.players as P
            JOIN {}.world_cup.teams AS T
            ON P.team=T.team
            WHERE surname <"C"
            LIMIT 5""".format(PROJECT_NAME, PROJECT_NAME)
query_job = client.query(query)
query_job.to_dataframe().head(10)

,surname,position,minutes,team,ranking,games,wins,draws,losses
0,Adiyiah,forward,33,Ghana,32,5,2,2,1
1,Amoah,forward,11,Ghana,32,5,2,2,1
2,Bautista,forward,45,Mexico,17,4,1,1,2
3,Bunjaku,forward,13,Switzerland,24,3,1,1,1
4,Abreu,forward,72,Uruguay,16,6,3,2,1

## Exercise 1 - World Cup datasets

### Simple Queries
The first three questions are already solved for you, so that you have concrete examples of queries. Try to solve the remaining ones!

*1)  Which player on a team ending with "ia" played less than 200 minutes and made more than 100 passes? Return the player's surname and team.*

**Hint**: To check if attribute A contains a (sub)string S, use the LIKE keyword (e.g. `A like '%S%'`). The % sign indicates a wildcard.

In [18]:
# Your query goes here
query = """select surname, team
            from {}.world_cup.players as P
            where P.team like '%ia'
            and P.minutes < 200 
            and P.passes > 100""".format(PROJECT_NAME)
query_job = client.query(query)
query_job.to_dataframe().head(10)

      surname    team
0  Kuzmanovic  Serbia

*2) Find all players who made more than 20 shots. Return all player information in descending order of shots made.*

**Hint**: Sorting results is done via the ORDER BY keyword. The default order is ascending (ASC). If you want descending order, use DESC (e.g. `ORDER BY column_1, column_2 DESC`).

In [19]:
# Your query goes here
query = """select *
            from {}.world_cup.players as P
            where shots > 20
            order by shots desc""".format(PROJECT_NAME)
query_job = client.query(query)
query_job.to_dataframe().head(10)

  surname       team position  minutes  shots  passes  tackles  saves
0    Gyan      Ghana  forward      501     27     151        1      0
1   Villa      Spain  forward      529     22     169        2      0
2   Messi  Argentina  forward      450     21     321       10      0

*3) Which team has the highest average number of passes per minute played? Return the team's name and average number of passes per minute.*

**Hint #1**: You can compute a team's average number of passes per minute played by dividing the total number of passes by the total number of minutes. To force floating point division, multiply one operand by 1.0.

**Hint #2**: Consider using the LIMIT keyword.

In [20]:
# Your query goes here
query = """SELECT *, (1.0 * total_passes / total_minutes) AS avg_ppm
            FROM (
                SELECT team, sum(passes) AS total_passes, sum(minutes) AS total_minutes
                FROM {}.world_cup.players_and_teams
                GROUP BY team)
            ORDER BY avg_ppm DESC
            LIMIT 1""".format(PROJECT_NAME)
query_job = client.query(query)
query_job.to_dataframe().head(10)

    team  total_passes  total_minutes   avg_ppm
0  Spain          3701           5940  0.623064

*4) Find the goalkeepers of teams that played more than four games. List the surname of the goalkeeper, the team, and the number of minutes the goalkeeper played.*

**Hint**: Use the `PlayersExt` table.

In [21]:
# Your query goes here
query = """select surname, team, minutes
            FROM {}.world_cup.players_and_teams
            where position like "goal%"
            and games > 4""".format(PROJECT_NAME)
query_job = client.query(query)
query_job.to_dataframe().head(10)

        surname         team  minutes
0      Casillas        Spain      540
1        Romero    Argentina      450
2  Stekelenburg  Netherlands      540
3         Neuer      Germany      540
4   Julio Cesar       Brazil      450
5       Kingson        Ghana      510
6       Muslera      Uruguay      570
7        Villar     Paraguay      480

*5) How many players on a team with a ranking lower than 10 played more than 350 minutes? Return a single number in a column named "superstar".*

**Hint**: To rename a column, use the AS keyword (e.g. `SELECT column_1 AS label`).

In [22]:
# Your query goes here
query = """select count(surname) as superstar
            FROM {}.world_cup.players_and_teams
            where ranking < 10
            and minutes > 350""".format(PROJECT_NAME)
query_job = client.query(query)
query_job.to_dataframe().head(10)

   superstar
0         54

*6) What is the average number of passes made by forwards? What about midfielders? Write one query that returns both values with the corresponding position.*

**Hint**: Use the GROUP BY keyword. GROUP BY statements are often used in conjuction with aggregate functions like AVG(), SUM() or COUNT().

In [23]:
# Your query goes here
query = """select position, avg(passes) as avg_passes
            FROM {}.world_cup.players
            where position in ("forward", "midfielder")
            group by position""".format(PROJECT_NAME)
query_job = client.query(query)
query_job.to_dataframe().head(10)

     position  avg_passes
0     forward   50.825175
1  midfielder   95.271930

### Advanced Queries
Now, on to more challenging questions...

*1) Find all pairs of teams that have the same number of `goalsFor` as well as the same number of `goalsAgainst` as each other. Return the team pairs and their respective numbers of `goalsFor` and `goalsAgainst` (make sure to return each pair only once!).*

**Hint**: You basically need to do a "self join" of the `Teams` table. For that, you need to join different name aliases of the same table. Check [this page](https://www.w3schools.com/sql/sql_join_self.asp) for help.

In [24]:
# Your query goes here
query = """select *
        FROM {}.world_cup.teams as T1, {}.world_cup.teams as T2
        LIMIT 3""".format(PROJECT_NAME, PROJECT_NAME)
query_job = client.query(query)
query_job.to_dataframe().head(10)

,team,ranking,games,wins,draws,losses,goalsFor,goalsAgainst,yellowCards,redCards,team_1,ranking_1,games_1,wins_1,draws_1,losses_1,goalsFor_1,goalsAgainst_1,yellowCards_1,redCards_1
0,Greece,13,3,1,0,2,2,5,5,0,North Korea,105,3,0,0,3,1,12,2,0
1,Greece,13,3,1,0,2,2,5,5,0,Greece,13,3,1,0,2,2,5,5,0
2,Greece,13,3,1,0,2,2,5,5,0,Honduras,38,3,0,1,2,0,3,7,0

In [25]:
query = """select A.team AS team_A, B.team AS team_B, A.goalsFor, A.goalsAgainst
            FROM {}.world_cup.teams as A, {}.world_cup.teams as B
            where A.team < B.team 
            and A.goalsFor = B.goalsFor
            and A.goalsAgainst = B.goalsAgainst""".format(PROJECT_NAME, PROJECT_NAME)
query_job = client.query(query)
query_job.to_dataframe().head(10)

      team_A        team_B  goalsFor  goalsAgainst
0   Cameroon        Greece         2             5
1    England       Nigeria         3             5
2    England  South Africa         3             5
3      Italy        Mexico         4             5
4      Chile       England         3             5
5      Chile       Nigeria         3             5
6      Chile  South Africa         3             5
7    Nigeria  South Africa         3             5
8  Australia       Denmark         3             6

*2) Find all teams with a ranking below 30 where no player has made more than 150 passes. Return the team's name and ranking.*

**Hint #1**: Consider using the HAVING keyword.

**Hint #2**: You may also want to look up nested queries.

In [26]:
# Your query goes here
query = """ SELECT *
            FROM (
                select team, min(ranking) as ranking, max(passes) as max_passes
                from {}.world_cup.players_and_teams
                group by team
            )
            where ranking < 30
            and max_passes <= 150
            """.format(PROJECT_NAME)
query_job = client.query(query)
query_job.to_dataframe().head(10)

          team  ranking  max_passes
0       France        9         125
1  Switzerland       24         138
2      Nigeria       21         111

*3) Which team has the highest ratio of goalsFor to goalsAgainst?*

In [27]:
# Your query goes here
query = """select team, goalsFor, goalsAgainst, (1.0 * goalsFor / goalsAgainst) as ratio
            FROM {}.world_cup.teams
            order by ratio desc
            limit 1""".format(PROJECT_NAME)
query_job = client.query(query)
query_job.to_dataframe().head(10)

       team  goalsFor  goalsAgainst  ratio
0  Portugal         7             1    7.0

*4) Find all teams whose defenders averaged more than 150 passes. Return the team and average number of passes by defenders, in descending order of average passes.*

In [28]:
# Your query goes here
query = """select team, avg(passes) as avg_passes
            FROM {}.world_cup.players_and_teams
            where position like "defender"
            group by team
            having avg_passes > 150
            order by avg_passes desc""".format(PROJECT_NAME)
query_job = client.query(query)
query_job.to_dataframe().head(10)

          team  avg_passes
0        Spain  213.000000
1       Brazil  190.000000
2      Germany  189.833333
3  Netherlands  182.500000
4       Mexico  152.142857

## Exercise 2 - Google Cloud datasets

Let's build some queries for the `accidents_2016` data from the NHTSA traffic facilities dataset, which is publicly available on Google BigQuery.

### Setting up

In [29]:
# Create a reference to the traffic facilities dataset
traffic_ref = client.dataset("nhtsa_traffic_fatalities", project="bigquery-public-data")

# API request - fetch the dataset
traffic_dataset = client.get_dataset(traffic_ref)

In [30]:
# Construct a reference to the "accident_2016" table
accidents_ref = traffic_ref.table("accident_2016")

# API request - fetch the table
accidents_table = client.get_table(accidents_ref)

In [31]:
# Display schema
accidents_table.schema

[SchemaField('state_number', 'INTEGER', 'NULLABLE', None, 'This data element identifies the state in which the crash occurred. The codes are from the General Services Administrations (GSA) publication of worldwide Geographic Location Codes (GLC). For more info on the codes, please look at <C1/V1/D1/PC1/P1/NM1 State Number> section in the pdf: https://crashstats.nhtsa.dot.gov/Api/Public/ViewPublication/812315', (), None),
 SchemaField('state_name', 'STRING', 'NULLABLE', None, 'This data element identifies the state in which the crash occurred. The codes are from the General Services Administrations (GSA) publication of worldwide Geographic Location Codes (GLC).', (), None),
 SchemaField('consecutive_number', 'INTEGER', 'NULLABLE', None, 'This data element is the unique case number assigned to each crash. It appears on each data file and is used to merge information from the data files together. xxxxxx Two Characters for State Code followed by Four Characters for Case Number', (), None),
 SchemaField('number_of_vehicle_forms_submitted_all', 'INTEGER', 'NULLABLE', None, 'number_of_vehicle_forms_submitted_all', (), None),
 SchemaField('number_of_motor_vehicles_in_transport_mvit', 'INTEGER', 'NULLABLE', None, 'This data element is a count of the number of vehicles in-transport involved in the crash. Legally parked vehicles are not included. 001-999 Number of Vehicle Forms', (), None),
 SchemaField('number_of_parked_working_vehicles', 'INTEGER', 'NULLABLE', None, 'This data element is a count of the number of parked and working vehicles involved in the crash. 0-999 Number of Parked/Working Vehicles in the Crash', (), None),
 SchemaField('number_of_forms_submitted_for_persons_not_in_motor_vehicles', 'INTEGER', 'NULLABLE', None, 'This data element is the number of Person Forms (Not a Motor Vehicle Occupant) that are applicable to this case (i.e., non-occupants). 00-99 Number of Persons Not in Motor Vehicles', (), None),
 SchemaField('number_of_persons_not_in_motor_vehicles_in_transport_mvit', 'INTEGER', 'NULLABLE', None, 'This data element is a count of the number of non-motorists in the crash. A non-motorist is defined as a pedestrian, a cyclist, an occupant of a motor vehicle not intransport, a person riding a horse, an occupant of an animal drawn conveyance, person associated with non-motorist conveyance (e.g., baby carriage, skate board, wheelchair), or an other non-motorist (e.g., person outside a trafficway, person in a house). 0-98 Number of Persons Not in Motor Vehicles in Transport', (), None),
 SchemaField('number_of_persons_in_motor_vehicles_in_transport_mvit', 'INTEGER', 'NULLABLE', None, 'This data element is a count of the number of motorists in the crash. A motorist is a driver, passenger or unknown occupant type of a motor vehicle in-transport. 0-999 Number of Persons in Motor Vehicles In-Transport', (), None),
 SchemaField('number_of_forms_submitted_for_persons_in_motor_vehicles', 'INTEGER', 'NULLABLE', None, 'This data element is a count of the number of Person Level (Motor Vehicle Occupant) Forms that are applicable to this case (i.e., occupants). 000-999 Number of Person Forms', (), None),
 SchemaField('county', 'INTEGER', 'NULLABLE', None, 'This data element records the location of the unstabilized event with regard to the County. The codes are from the General Services Administrations (GSA) publication of worldwide Geographic Location Codes (GLC). 000 Not Applicable 001-996 Use GSA Geographical Codes 997 Other 998 Not Reported 999 Unknown', (), None),
 SchemaField('city', 'INTEGER', 'NULLABLE', None, 'This data element records the location of the unstabilized event with regard to the City. The codes are from the General Services Administrations (GSA) publication of worldwide Geographic Location Codes (GLC). 0000 Not Applicable 0001-9996 GSA Geographical Codes 9997 Other 9898 Not Reported 9999 Unknown', (), None),
 SchemaField('day_of_crash', 'INTEGER', 'NULLABLE', None, 'This data element records the day of the month on which the crash occurred. 01-31 Day of the Month of the Crash -- Unknown', (), None),
 SchemaField('month_of_crash', 'INTEGER', 'NULLABLE', None, 'This data element records the month in which the crash occurred. For more info on the codes, please look at <C8A Month of Crash> section in the pdf: https://crashstats.nhtsa.dot.gov/Api/Public/ViewPublication/812315', (), None),
 SchemaField('year_of_crash', 'INTEGER', 'NULLABLE', None, 'This data element records the year in which the crash occurred. xxxx Year of the Crash', (), None),
 SchemaField('day_of_week', 'INTEGER', 'NULLABLE', None, 'This data element records the day of the week on which the crash occurred. 1 Sunday 2 Monday 3 Tuesday 4 Wednesday 5 Thursday 6 Friday 7 Saturday -- Unknown', (), None),
 SchemaField('hour_of_crash', 'INTEGER', 'NULLABLE', None, 'This data element records the hour at which the crash occurred. 00-23 Hour -- Not Applicable or Not Notified 99 Unknown', (), None),
 SchemaField('minute_of_crash', 'INTEGER', 'NULLABLE', None, 'This data element records the minutes after the hour at which the crash occurred. 00-59 Minute -- Not Applicable or Not Notified 99 Unknown', (), None),
 SchemaField('national_highway_system', 'INTEGER', 'NULLABLE', None, 'This data element identifies whether this crash occurred on a trafficway that is part of the National Highway System. 0 This Section is Not on the National Highway System 1 This Section is on the National Highway System 9 Unknown', (), None),
 SchemaField('land_use', 'INTEGER', 'NULLABLE', None, '1 (Rural), 2 (Urban), 6 (Trafficway Not in State Inventory), 8 (Not Reported) and 9 (Unknown).', (), None),
 SchemaField('land_use_name', 'STRING', 'NULLABLE', None, '1 (Rural), 2 (Urban), 6 (Trafficway Not in State Inventory), 8 (Not Reported) and 9 (Unknown).', (), None),
 SchemaField('functional_system', 'INTEGER', 'NULLABLE', None, '01 (Interstate), 02 (Principal Arterial  Other Freeways and Expressways), 03 (Principal Arterial  Other), 04 (Minor Arterial), 05 (Major Collector), 06 (Minor Collector), 07 (Local), 96 (Trafficway Not in State Inventory), 98 (Not Reported), and 99 (Unknown).', (), None),
 SchemaField('functional_system_name', 'STRING', 'NULLABLE', None, '01 (Interstate), 02 (Principal Arterial  Other Freeways and Expressways), 03 (Principal Arterial  Other), 04 (Minor Arterial), 05 (Major Collector), 06 (Minor Collector), 07 (Local), 96 (Trafficway Not in State Inventory), 98 (Not Reported), and 99 (Unknown).', (), None),
 SchemaField('ownership', 'INTEGER', 'NULLABLE', None, 'For more info on the codes, please look at <C13 Ownership> section in the pdf: https://crashstats.nhtsa.dot.gov/Api/Public/ViewPublication/812315', (), None),
 SchemaField('ownership_name', 'STRING', 'NULLABLE', None, 'For more info on the codes, please look at <C13 Ownership> section in the pdf: https://crashstats.nhtsa.dot.gov/Api/Public/ViewPublication/812315', (), None),
 SchemaField('route_signing', 'INTEGER', 'NULLABLE', None, 'This data element identifies the route signing of the trafficway on which the crash occurred. 1 Interstate 2 U.S. Highway 3 State Highway 4 County Road 5 Local Street  Township 6 Local Street  Municipality 7 Local Street  Frontage Road (Since 1994) 8 Other 9 Unknown', (), None),
 SchemaField('route_signing_name', 'STRING', 'NULLABLE', None, 'This data element identifies the route signing of the trafficway on which the crash occurred.', (), None),
 SchemaField('trafficway_identifier', 'STRING', 'NULLABLE', None, 'This data element records the trafficway on which the crash occurred. xxxxxxxxxxxxxxxxxxxxxxxxxxxxxx Actual Posted Number, Assigned Number, or Common Name (30 characters) 999999999999999999999999999999 Unknown', (), None),
 SchemaField('trafficway_identifier_2', 'STRING', 'NULLABLE', None, 'This data element records the trafficway on which the crash occurred. xxxxxxxxxxxxxxxxxxxxxxxxxxxxxx Actual Posted Number, Assigned Number, or Common Name (30 characters) 999999999999999999999999999999 Unknown', (), None),
 SchemaField('milepoint', 'INTEGER', 'NULLABLE', None, 'This data element records the milepoint nearest to the location where the crash occurred. 00000 None xxxxx Actual to Nearest Tenth Mile (Assume decimal, e.g., 12345 = 1234.5) 99998 Not Reported 99999 Unknown', (), None),
 SchemaField('latitude', 'FLOAT', 'NULLABLE', None, 'This element identifies the location of the crash using Global Position coordinates. This is the position of latitude. DDDDDD (DD.DDDD  Decimal Degrees) DD.DDDD Actual Degrees 77.7777 Not Reported 88.8888 Not Available (If State Exempt) 99.9999 Unknown', (), None),
 SchemaField('longitude', 'FLOAT', 'NULLABLE', None, 'This element identifies the location of the crash using Global Position coordinates. This is the position of longitude. DDDDDDD (DDD.DDDD  Decimal Degrees) DDD.DDDD Actual Degrees 777.7777 Not Reported 888.8888 Not Available (If State Exempt) 999.9999 Unknown', (), None),
 SchemaField('special_jurisdiction', 'INTEGER', 'NULLABLE', None, 'This data element identifies if the location on the trafficway where the crash occurred qualifies as a Special Jurisdiction even though it may be patrolled by state, county or local police (e.g., all State highways running through Indian reservations are under the jurisdiction of the Indian reservation). 0 No Special Jurisdiction (Includes National Forests Since 2008) 1 National Park Service 2 Military 3 Indian Reservation 4 College/University Campus 5 Other Federal Properties (Since 1977) 8 Other (Since 1976) 9 Unknown', (), None),
 SchemaField('special_jurisdiction_name', 'STRING', 'NULLABLE', None, 'This data element identifies if the location on the trafficway where the crash occurred qualifies as a Special Jurisdiction even though it may be patrolled by state, county or local police (e.g., all State highways running through Indian reservations are under the jurisdiction of the Indian reservation).', (), None),
 SchemaField('first_harmful_event', 'INTEGER', 'NULLABLE', None, 'This data element describes the first injury or damage producing event of the crash. For more info on the codes, please look at <C19 First Harmful Event> section in the pdf: https://crashstats.nhtsa.dot.gov/Api/Public/ViewPublication/812315', (), None),
 SchemaField('first_harmful_event_name', 'STRING', 'NULLABLE', None, 'This data element describes the first injury or damage producing event of the crash.', (), None),
 SchemaField('manner_of_collision', 'INTEGER', 'NULLABLE', None, 'This data element describes the orientation of two motor vehicles in-transport when they are involved in the First Harmful Event of a collision crash. If the First Harmful Event is not a collision between two motor vehicles in-transport it is classified as such. For more info on the codes, please look at <C20 Manner of Collision> section in the pdf: https://crashstats.nhtsa.dot.gov/Api/Public/ViewPublication/812315', (), None),
 SchemaField('manner_of_collision_name', 'STRING', 'NULLABLE', None, 'This data element describes the orientation of two motor vehicles in-transport when they are involved in the First Harmful Event of a collision crash. If the First Harmful Event is not a collision between two motor vehicles in-transport it is classified as such.', (), None),
 SchemaField('relation_to_junction_within_interchange_area', 'STRING', 'NULLABLE', None, "This data element identifies the crash's location with respect to presence in an interchange area. The coding of this data element is done in two sub-fields (see also C20B) and is based on the location of the First Harmful Event of the crash. 0 No 1 Yes 8 Not Reported 9 Unknown", (), None),
 SchemaField('relation_to_junction_specific_location', 'INTEGER', 'NULLABLE', None, "This data element identifies the crash's location with respect to presence in or proximity to components typically in junction or interchange areas. The coding of this data element is done in two sub-fields (see also C20A) and is based on the location of the First Harmful Event of the crash. For more info on the codes, please look at <C21B Relation to Junction- Specific Location> section in the pdf: https://crashstats.nhtsa.dot.gov/Api/Public/ViewPublication/812315", (), None),
 SchemaField('relation_to_junction_specific_location_name', 'STRING', 'NULLABLE', None, "This data element identifies the crash's location with respect to presence in or proximity to components typically in junction or interchange areas. The coding of this data element is done in two sub-fields (see also C20A) and is based on the location of the First Harmful Event of the crash.", (), None),
 SchemaField('type_of_intersection', 'STRING', 'NULLABLE', None, 'This data element identifies and allows separation of various intersection types. 1 Not an Intersection 2 Four-Way Intersection 3 T-Intersection 4 Y-Intersection 5 Traffic Circle 6 Roundabout 7 Five-Point, or More 10 L-Intersection 98 Not Reported 99 Unknown', (), None),
 SchemaField('work_zone', 'STRING', 'NULLABLE', None, 'This data element identifies a motor vehicle traffic crash in which the first harmful event occurs within the boundaries of a work zone or on an approach to or exit from a work zone, resulting from an activity, behavior, or control related to the movement of the traffic units through the work zone. 0 None 1 Construction 2 Maintenance -- Construction or Maintenance 3 Utility 4 Work Zone, Type Unknown -- Not Reported', (), None),
 SchemaField('relation_to_trafficway', 'INTEGER', 'NULLABLE', None, 'This data element identifies the location of the crash as it relates to its position within or outside the trafficway based on the First Harmful Event. For more info on the codes, please look at <C23 Relation to Trafficway> section in the pdf: https://crashstats.nhtsa.dot.gov/Api/Public/ViewPublication/812315', (), None),
 SchemaField('relation_to_trafficway_name', 'STRING', 'NULLABLE', None, 'This data element identifies the location of the crash as it relates to its position within or outside the trafficway based on the First Harmful Event.', (), None),
 SchemaField('light_condition', 'INTEGER', 'NULLABLE', None, 'This data element records the type/level of light that existed at the time of the crash as indicated in the case material. For more info on the codes, please look at <C25 Light Condition> section in the pdf: https://crashstats.nhtsa.dot.gov/Api/Public/ViewPublication/812315', (), None),
 SchemaField('light_condition_name', 'STRING', 'NULLABLE', None, 'This data element records the type/level of light that existed at the time of the crash as indicated in the case material.', (), None),
 SchemaField('atmospheric_conditions_1', 'INTEGER', 'NULLABLE', None, 'This data element records the prevailing atmospheric conditions that existed at the time of the crash as indicated in the case material. For more info on the codes, please look at <C26 Atmospheric Conditions> section in the pdf: https://crashstats.nhtsa.dot.gov/Api/Public/ViewPublication/812315', (), None),
 SchemaField('atmospheric_conditions_1_name', 'STRING', 'NULLABLE', None, 'This data element records the prevailing atmospheric conditions that existed at the time of the crash as indicated in the case material.', (), None),
 SchemaField('atmospheric_conditions_2', 'INTEGER', 'NULLABLE', None, 'This data element records the prevailing atmospheric conditions that existed at the time of the crash as indicated in the case material. For more info on the codes, please look at <C26 Atmospheric Conditions> section in the pdf: https://crashstats.nhtsa.dot.gov/Api/Public/ViewPublication/812315', (), None),
 SchemaField('atmospheric_conditions_2_name', 'STRING', 'NULLABLE', None, 'This data element records the prevailing atmospheric conditions that existed at the time of the crash as indicated in the case material.', (), None),
 SchemaField('atmospheric_conditions', 'INTEGER', 'NULLABLE', None, 'This data element records the prevailing atmospheric conditions that existed at the time of the crash as indicated in the case material. For more info on the codes, please look at <C26 Atmospheric Conditions> section in the pdf: https://crashstats.nhtsa.dot.gov/Api/Public/ViewPublication/812315', (), None),
 SchemaField('atmospheric_conditions_name', 'STRING', 'NULLABLE', None, 'This data element records the prevailing atmospheric conditions that existed at the time of the crash as indicated in the case material.', (), None),
 SchemaField('school_bus_related', 'STRING', 'NULLABLE', None, 'This data element identifies if a school bus, or motor vehicle functioning as a school bus, is related to the crash. 0 No 1 Yes -- Not Reported', (), None),
 SchemaField('rail_grade_crossing_identifier', 'STRING', 'NULLABLE', None, 'This data element identifies if the crash occurred in or near a rail grade crossing. 0000000 Not Applicable xxxxxxA Six Digits Followed by One Alphabetic Valid F.R.A. Code 9999999 Unknown', (), None),
 SchemaField('hour_of_notification', 'INTEGER', 'NULLABLE', None, 'This data element records the hour that emergency medical service was notified. 00-23 Hour -- Not Applicable or Not Notified (when NOT_MIN = 00) 88 Not Applicable or Not Notified 99 Unknown Hour 99 Unknown if Notified (when NOT_MIN = 98)', (), None),
 SchemaField('minute_of_notification', 'INTEGER', 'NULLABLE', None, 'This data element records the minutes after the hour that emergency medical service was notified. 00-59 Minute -- Not Applicable or Not Notified (when NOT_HOUR = 00) 88 Not Applicable or Not Notified 98 Unknown if Notified 99 Unknown Minutes', (), None),
 SchemaField('hour_of_arrival_at_scene', 'INTEGER', 'NULLABLE', None, 'This data element records the hour that emergency medical service arrived on the crash scene. 00-23 Hour -- Not Notified or Officially Cancelled (when ARR_MIN = 00) -- Not Notified (when ARR_MIN = 00) 88 Not Applicable or Not Notified 99 Unknown Hour 99 Officially Cancelled (when ARR_MIN = 97) 99 Unknown if Arrived (when ARR_MIN = 98)', (), None),
 SchemaField('minute_of_arrival_at_scene', 'INTEGER', 'NULLABLE', None, 'This data element records the minutes after the hour that emergency medical service arrived on the crash scene. 00-59 Minute 00 -- Not Notified or Officially Cancelled (when ARR_HOUR = 00) -- Not Notified (when ARR_HOUR = 00) 88 Not Applicable or Not Notified 97 Officially Cancelled 98 Unknown if Arrived 99 Unknown Minutes', (), None),
 SchemaField('hour_of_ems_arrival_at_hospital', 'INTEGER', 'NULLABLE', None, 'This data element records the hour that emergency medical service arrived at the treatment facility to which it was transporting victims of the crash. 00-23 Hour -- Not Notified, Officially Cancelled or Not Transported (when HOSP_MIN = 00) -- Not Notified or Not Transported (when HOSP_MIN = 00) 88 Not Applicable or Not Notified 99 Unknown Hour 99 Officially Cancelled (when HOSP_MIN = 97) 99 Unknown if Transported (when HOSP_MIN = 98)', (), None),
 SchemaField('minute_of_ems_arrival_at_hospital', 'INTEGER', 'NULLABLE', None, 'This data element records the minutes after the hour that emergency medical service arrived at the treatment facility to which it was transporting victims of the crash. 00-59 Minute -- Not Notified, Officially Cancelled or Not Transported (when HOSP_HR = 00) -- Not Notified or Not Transported (when HOSP_HR = 00) 88 Not Applicable or Not Notified 96 Terminated Transport 97 Officially Cancelled 98 Unknown if Transported 99 Unknown Minutes', (), None),
 SchemaField('related_factors_crash_level_1', 'INTEGER', 'NULLABLE', None, 'This data element records factors related to the crash expressed by the investigating officer. For more info on the codes, please look at <C32 Related Factors- Crash Level> section in the pdf: https://crashstats.nhtsa.dot.gov/Api/Public/ViewPublication/812315', (), None),

In [32]:
# Show a preview of the "accident_2016" table
client.list_rows(accidents_table, max_results=5).to_dataframe()

,state_number,state_name,consecutive_number,number_of_vehicle_forms_submitted_all,number_of_motor_vehicles_in_transport_mvit,number_of_parked_working_vehicles,number_of_forms_submitted_for_persons_not_in_motor_vehicles,number_of_persons_not_in_motor_vehicles_in_transport_mvit,number_of_persons_in_motor_vehicles_in_transport_mvit,number_of_forms_submitted_for_persons_in_motor_vehicles,...,minute_of_ems_arrival_at_hospital,related_factors_crash_level_1,related_factors_crash_level_1_name,related_factors_crash_level_2,related_factors_crash_level_2_name,related_factors_crash_level_3,related_factors_crash_level_3_name,number_of_fatalities,number_of_drunk_drivers,timestamp_of_crash
0,16,Idaho,160065,2,1,1,0,1,2,3,...,99,19,Recent Previous Crash Scene Nearby (Since 1989),0,None,0,None,1,0,2016-05-21 18:05:00+00:00
1,24,Maryland,240021,1,1,0,0,0,3,3,...,99,0,None,0,None,0,None,1,0,2016-01-16 14:30:00+00:00
2,31,Nebraska,310185,1,1,0,0,0,2,2,...,99,0,None,0,None,0,None,1,0,2016-12-16 17:10:00+00:00
3,37,North Carolina,370035,2,1,1,0,1,4,5,...,99,0,None,0,None,0,None,1,0,2016-01-22 13:50:00+00:00
4,39,Ohio,391029,1,1,0,0,0,5,5,...,55,0,None,0,None,0,None,2,0,2016-12-17 01:45:00+00:00

### Questions

You can access the table using `from bigquery-public-data.nhtsa_traffic_fatalities.accident_2016`.

1) How many crashes happened in each month of 2016?

In [33]:
q3 = """
select month_of_crash, count(*) as count
from bigquery-public-data.nhtsa_traffic_fatalities.accident_2016
group by month_of_crash
order by month_of_crash
"""

query_job_3 = client.query(q3)
query_job_3.to_dataframe()

    month_of_crash  count
0                1   2354
1                2   2426
2                3   2694
3                4   2713
4                5   3005
5                6   3025
6                7   3025
7                8   3134
8                9   3154
9               10   3287
10              11   3041
11              12   2890

2) Let's call the accidents involving more than 5 motor vehichles in transport involved as "massive_crash", and all others as "small crash". Return the number of each type of crash for each weather condition.

**Hint**: Use columns `atmospheric_conditions_1_name` and `number_of_motor_vehicles_in_transport_mvit`.

In [34]:
q4 = """
select
  atmospheric_conditions_1_name,
  (case when number_of_motor_vehicles_in_transport_mvit > 5 then "massive_crash"
  else "small_crash" end) as crash_type,
  count(*) as nb_crashes
from bigquery-public-data.nhtsa_traffic_fatalities.accident_2016
group by atmospheric_conditions_1_name, crash_type
order by atmospheric_conditions_1_name
"""

query_job_4 = client.query(q4)
query_job_4.to_dataframe()

   atmospheric_conditions_1_name     crash_type  nb_crashes
0       Blowing Sand, Soil, Dirt    small_crash          20
1                   Blowing Snow    small_crash          10
2                          Clear    small_crash       24893
3                          Clear  massive_crash          63
4                         Cloudy    small_crash        5112
5                         Cloudy  massive_crash          14
6               Fog, Smog, Smoke    small_crash         328
7               Fog, Smog, Smoke  massive_crash           1
8       Freezing Rain or Drizzle    small_crash          17
9                   Not Reported    small_crash        1552
10                  Not Reported  massive_crash           2
11                         Other    small_crash          48
12                          Rain    small_crash        2102
13                          Rain  massive_crash           5
14             Severe Crosswinds    small_crash          42
15                   Sleet, Hail    small_crash          65
16                          Snow    small_crash         326
17                          Snow  massive_crash           2
18                       Unknown    small_crash         146

3) Find the top 5 states with the highest number of drunk drivers involved in accidents.

In [35]:
q5 = """
select state_name, sum(number_of_drunk_drivers) as nb_drunk_drivers
from bigquery-public-data.nhtsa_traffic_fatalities.accident_2016
group by state_name
order by nb_drunk_drivers desc
limit 5
"""

query_job_5 = client.query(q5)
query_job_5.to_dataframe()

       state_name  nb_drunk_drivers
0      California              1052
1           Texas               918
2         Florida               665
3  North Carolina               399
4            Ohio               365

4) Let's find out the states where using a cell phone is a major cause of accidents. Return the first 5 state names along with the number of crashes where the driver was distracted "while manipulating cellular phone".

**Hint**: You need to join the `distract_2016` and `accident_2016` tables.

In [36]:
q6 = """
select
  count(distract.driver_distracted_by) as nb_accidents,
  accident.state_name
from bigquery-public-data.nhtsa_traffic_fatalities.distract_2016 distract
join bigquery-public-data.nhtsa_traffic_fatalities.accident_2016 accident
on distract.consecutive_number = accident.consecutive_number
where driver_distracted_by = 6
group by state_name
order by nb_accidents desc
limit 5
"""

query_job_6 = client.query(q6)
query_job_6.to_dataframe()

   nb_accidents      state_name
0            18           Texas
1             9        Missouri
2             9      California
3             8  North Carolina
4             8         Georgia

In [37]:
q6_1 = """
with
  join_acc_dist as (
    select distract.driver_distracted_by, accident.state_name
    from bigquery-public-data.nhtsa_traffic_fatalities.distract_2016 distract
    join bigquery-public-data.nhtsa_traffic_fatalities.accident_2016 accident
    on distract.consecutive_number = accident.consecutive_number
    )
select count(driver_distracted_by) as nb_accidents, state_name from join_acc_dist
where driver_distracted_by = 6
group by state_name
order by nb_accidents desc
limit 5
"""

query_job_6_1 = client.query(q6_1)
query_job_6_1.to_dataframe()

   nb_accidents      state_name
0            18           Texas
1             9        Missouri
2             9      California
3             8  North Carolina
4             8         Georgia

5) Sometimes, a "live animal" is a reason that a driver maneuvers and causes an accident. In which months of the year do such accidents happen the most? Return the month and the number of accidents. 

**Hint**: You need to join the `maneuver_2016` and `accident_2016` tables.

In [38]:
q7 = """
select
  accident.month_of_crash,
  count(maneuver.driver_maneuvered_to_avoid) as nb_accidents
from bigquery-public-data.nhtsa_traffic_fatalities.maneuver_2016 maneuver
join bigquery-public-data.nhtsa_traffic_fatalities.accident_2016 accident
on maneuver.consecutive_number = maneuver.consecutive_number
where driver_maneuvered_to_avoid = 3
group by month_of_crash
order by nb_accidents desc
"""

query_job_7 = client.query(q7)
query_job_7.to_dataframe()

    month_of_crash  nb_accidents
0               10        384579
1                9        369018
2                8        366678
3               11        355797
4                7        353925
5                6        353925
6                5        351585
7               12        338130
8                4        317421
9                3        315198
10               2        283842
11               1        275418

6) In the state of Alaska, in which months do "poor road conditions" cause the most accidents? Return the month and the number of accidents. 

**Hint**: Again, you will need the `maneuver_2016` table.

In [39]:
q8 = """
select
  accident.month_of_crash,
  count(maneuver.driver_maneuvered_to_avoid) as nb_accidents
from bigquery-public-data.nhtsa_traffic_fatalities.maneuver_2016 maneuver
join bigquery-public-data.nhtsa_traffic_fatalities.accident_2016 accident
on maneuver.consecutive_number = maneuver.consecutive_number
where driver_maneuvered_to_avoid = 3
  and accident.state_name = "Alaska"
group by month_of_crash
order by nb_accidents desc
"""

query_job_8 = client.query(q8)
query_job_8.to_dataframe()

    month_of_crash  nb_accidents
0               11          1053
1                7          1053
2                8           936
3                6           936
4                4           819
5               10           819
6                9           702
7                1           702
8               12           702
9                5           702
10               2           468
11               3           234

7) Sometimes, a factor of the accident is that the vehicle has a problem with the "brake system". Filter the accidents with this factor and return the `driver_maneuvered_to_avoid_name` column along with the related number of accidents.
 
**Hint**: You need to join the `maneuver_2016` and `factor_2016` tables.

In [40]:
q9 = """
select
  maneuver.driver_maneuvered_to_avoid_name,
  count(maneuver.consecutive_number) as num_incidents
from bigquery-public-data.nhtsa_traffic_fatalities.maneuver_2016 maneuver
join bigquery-public-data.nhtsa_traffic_fatalities.factor_2016 factor
on maneuver.consecutive_number = factor.consecutive_number
where factor.contributing_circumstances_motor_vehicle = 2
group by driver_maneuvered_to_avoid_name
order by num_incidents desc
"""

query_job_9 = client.query(q9)
query_job_9.to_dataframe()

               driver_maneuvered_to_avoid_name  num_incidents
0             Driver Did Not Maneuver To Avoid             97
1                                 Not Reported             93
2                                Motor Vehicle             25
3            Phantom/Non-Contact Motor Vehicle              5
4  No Driver Present/Unknown if Driver Present              3
5                                  Live Animal              1

8) Sometimes, a non-motorist is involved in a crash. For each state, find the number of crashes in which an "inattentive" person was involved. Return the state name and number of crashes.

**Hint**: You need to join the `nmcrash_2016` and `accident_2016` tables.

In [41]:
q10 = """
select
  accident.state_name,
  count(nmcrash.consecutive_number) as nb_accidents
from bigquery-public-data.nhtsa_traffic_fatalities.nmcrash_2016 nmcrash
join bigquery-public-data.nhtsa_traffic_fatalities.accident_2016 accident
on nmcrash.consecutive_number = accident.consecutive_number
where nmcrash.non_motorist_contributing_circumstances = 6
group by state_name
order by nb_accidents desc
"""

query_job_10 = client.query(q10)
query_job_10.to_dataframe()

        state_name  nb_accidents
0        Louisiana            17
1          Georgia            16
2   North Carolina            14
3         Missouri            12
4       Washington             9
5       California             8
6             Ohio             7
7            Texas             7
8       New Jersey             6
9          Florida             4
10        Maryland             4
11        New York             4
12  South Carolina             4
13         Arizona             3
14     Connecticut             3
15          Kansas             3
16        Illinois             2
17          Nevada             2
18      New Mexico             2
19          Oregon             2
20       Tennessee             2
21         Vermont             1
22           Idaho             1
23            Iowa             1
24         Alabama             1
25        Colorado             1
26        Delaware             1
27        Kentucky             1
28    Pennsylvania             1
29            Utah             1
30       Wisconsin             1